Revit 2024 API
ParameterTypeId.AutoJoinConditionWall Property
 "Join Condition"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AutoJoinConditionWall { get; }
Visual Basic
Public Shared ReadOnly Property AutoJoinConditionWall As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AutoJoinConditionWall {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace